{
  "pageType":"function",
  "title":"dateTimeFormat",
  "name":"dateTimeFormat",
  "memberName":"",
  "description":"Formats a date/time string to a given output",
  "status":"",
  "deprecated":false,
  "class":"lucee.runtime.functions.displayFormatting.DateTimeFormat",
  "returnType":"string",
  "argumentType":"",
  "keywords":[
    "date",
    "string",
    "formatting"
  ],
  "arguments":[
    {
      "name":"datetime",
      "description":"Datetime object",
      "type":"any",
      "required":true,
      "default":""
    },
    {
      "name":"mask",
      "description":"\nMask that has to be used for formatting.\nthe following characters are pattern letters (case sensitive) representing the components of a datetime string. All other characters are not interpreted\n- a,..,aaaa: AM/PM marker (see also \"t\" and \"tt\"; Example:AM)\n- d: Day in month, no leading zero for single-digit days (Example:3)\n- dd: Day in month, leading zero for single-digit days (Example:03)\n- D: Day in year, no leading zero for single-digit days (Example:4)\n- DD: Day in month, leading zero for single-digit days (Example:04)\n- DDD: Day in month, 2 leading zero for single-digit days (Example:004)\n- E,EE,EEE: Day of week as a three-letter abbreviation (Example:Tue)\n- EEEE: Day of week as its full name (Example:Tuesday)\n- F: Day of week in month, no leading zero for single-digit days (Example:4)\n- FF: Day of week in month, leading zero for single-digit days (Example:04)\n- G,GG: Era designator (Example:AD)\n- h: Hour in am/pm (1-12), no leading zero for single-digit hours (Example:3)\n- hh: Hour in am/pm (1-12), leading zero for single-digit hours (Example:03)\n- H: Hour in day (0-23), no leading zero for single-digit hours (Example:14)\n- HH: Hour in day (00-23), leading zero for single-digit hours (Example:14)\n- k: Hour in day (1-24), no leading zero for single-digit hours (Example:15)\n- kk: Hour in day (1-24), leading zero for single-digit hours (Example:15)\n- K: Hour in am/pm (0-11), no leading zero for single-digit hours (Example:2)\n- KK: Hour in am/pm (0-11), leading zero for single-digit hours (Example:02)\n- l,L: milliseconds, with no leading zeros (Example:3)\n- ll,LL: milliseconds, leading zero for single-digit days (Example:03)\n- lll,LLL: milliseconds,  2 leading zero for single-digit days (Example:003)\n- m,M: Month as digits, no leading zero for single-digit months (Example:6)\n- mm,MM: Month as digits, leading zero for single-digit months (Example:06)\n- mmm,MMM: Month as a three-letter abbreviation (Example:Jun)\n- mmmm,MMMM: Month as its full name (Example:June)\n- n,N: minutes in hour, no leading zero for single-digit minutes (Example:3)\n- nn,NN: minutes in hour, leading zero for single-digit minutes (Example:03)\n- s,S: seconds in minute, no leading zero for single-digit seconds (Example:3)\n- ss,SS: seconds in minute, leading zero for single-digit seconds (Example:03)\n- t,T: one-character time marker string (Example:P)\n- tt,TT: multiple-character time marker string (Example:PM)\n- w: Week in year, no leading zero for single-digit hours (Example:27)\n- ww: Week in year, leading zero for single-digit hours (Example:27)\n- W: Week in month, no leading zero for single-digit hours (Example:2)\n- WW: Week in month, leading zero for single-digit hours (Example:02)\n- y,yy,yyy: Year as last two digits, leading zero for single-digit (Example:09)\n- yyyy: Year represented by four digits (Example:2009)\n- z,zz,zzz: General time zone as a 3 to 4 lettesr abbreviation (Example:PST)\n- zzzz: General time zone as its full name (Example:Pacific Standard Time)\n- Z,..,ZZZZ: RFC 822 time zone (Example:-0800)\n\nThe following masks can be used to format the full date and time and may not be combined with other masks:\n- short: equivalent to \"m/d/y h:mm tt\"\n- medium: equivalent to \"mmm d, yyyy h:mm:ss tt\"\n- long: medium followed by three-letter time zone; i.e. \"mmmm d, yyyy h:mm:ss tt zzz\"\n- full: equivalent to \"dddd, mmmm d, yyyy h:mm:ss tt zz\"\n- ISO8601: equivalent to \"yyyy-mm-dd'T'HH:nn:ss'Z'Z\"\n\nThe function follows Java date time mask.  For details, see the section Date and Time Patterns at http://docs.oracle.com/javase/7/docs/api/java/text/SimpleDateFormat.html\n",
      "type":"string",
      "required":false,
      "default":"dd-MMM-yyyy HH:nn:ss"
    },
    {
      "name":"timezone",
      "description":"\nA datetime object is independent of a specific timezone, it is only a offset in milliseconds from 1970-1-1 00.00:00 UTC (Coordinated Universal Time).\nThis means that the timezone only comes into play when you need specific information like hours in a day, minutes in a hour or which day it is since those calculations depend on the timezone.\nFor these calculations, a timezone must be specified in order to translate the date object to something else. If you do not provide the timezone in the function call, it will default to the timezone specified in the Lucee Administrator (Settings/Regional), or the timezone specified for the current request using the function setTimezone.\nYou can find a list of all available timezones in the Lucee administrator (Settings/Regional). Some examples of valid timezones:\n       - AGT (for time in Argentina)\n       - Europe/Zurich (for time in Zurich/Switzerland)\n       - HST (Hawaiian Standard Time in the USA)\n\t\t",
      "type":"string",
      "required":false,
      "default":""
    }
  ],
  "examples":[
    
  ],
  "history":[
    
  ]
}