{
  "pageType":"function",
  "title":"lSDateTimeFormat",
  "name":"lSDateTimeFormat",
  "memberName":"",
  "description":"Formats a date string to a given output using the current locale",
  "status":"",
  "deprecated":false,
  "class":"lucee.runtime.functions.international.LSDateTimeFormat",
  "returnType":"string",
  "argumentType":"",
  "keywords":[
    "date",
    "string",
    "formatting"
  ],
  "arguments":[
    {
      "name":"date",
      "description":"date object",
      "type":"any",
      "required":true,
      "default":""
    },
    {
      "name":"mask",
      "description":"\n\t\tMask that has to be used for formatting. The function follows Java date time mask. For details, see the section Date and Time Patterns at the following URL: http://docs.oracle.com/javase/1.4.2/docs/api/java/text/SimpleDateFormat.html\n\t\t",
      "type":"string",
      "required":false,
      "default":"dd-MMM-yyyy HH:nn:ss"
    },
    {
      "name":"locale",
      "description":"Locale to use instead of the locale of the page when processing the function",
      "type":"string",
      "required":false,
      "default":""
    },
    {
      "name":"timezone",
      "description":"\nA datetime object is independent of a specific timezone, it is only a offset in milliseconds from 1970-1-1 00.00:00 UTC (Coordinated Universal Time).\nThis means that the timezone only comes into play when you need specific information like hours in a day, minutes in a hour or which day it is since those calculations depend on the timezone.\nFor these calculations, a timezone must be specified in order to translate the date object to something else. If you do not provide the timezone in the function call, it will default to the timezone specified in the Lucee Administrator (Settings/Regional), or the timezone specified for the current request using the function setTimezone.\nYou can find a list of all available timezones in the Lucee administrator (Settings/Regional). Some examples of valid timezones:\n       - AGT (for time in Argentina)\n       - Europe/Zurich (for time in Zurich/Switzerland)\n       - HST (Hawaiian Standard Time in the USA)\n\t\t",
      "type":"string",
      "required":false,
      "default":""
    }
  ],
  "examples":[
    
  ],
  "history":[
    
  ]
}